{
  "main": {
    "name": "Rahul Meghani",
    "occupation": "",
    "description": "Currently looking for the full time opportunities in the Software Engineering Industry",
    "image": "profilepic.jpg",
    "bio": "Hi there! I am Rahul. Results-driven Software Engineer with 2.5 years of experience in full-stack development, project management, and implementing eCommerce and SaaS web-based applications. Proficient in Java, Python and NodeJS with a track record of delivering user-centered websites that scale. Strong background in agile development and cross-functional team collaboration.",
    "contactmessage": "Get in touch with me",
    "email": "rahulmeghani36@gmail.com",
    "phone": "+1 (226) 724-1895",
    "address": {
      "street": "",
      "city": "Windsor",
      "state": "Ontario",
      "zip": "N9B 2Z6"
    },
    "website": "https://www.papareact.com/course",
    "resumedownload": "http://papareact.com",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/rahulmeghani36",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/rahuljmeghani",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/netfreak29/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/RaHuLMeghani24",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My Programming Language Proficiency",
    "education": [
      {
        "school": "Gujarat Technological University (India)",
        "degree": "Bachelors of Engineering, Computer Engineering",
        "graduated": "June 2019",
        "description": "Graduated with First Class Honours. Relevant Coursework: Object Oriented Programming, Data Structures, Operating System, Software Engineering"
      },
      {
        "school": "University of Windsor - CA",
        "degree": "Master's Degree, Applied Computing",
        "graduated": "September 2022",
        "description": "Graduated with First Class Honours. Relevant Coursework: Advanced Computing Concepts, Advanced Software Engineering topics, Distributed Databases"
      }
    ],
    "work": [
      {
        "company": "Toronto-Dominion Bank (TD Bank)",
        "title": "Software Engineer Intern",
        "years": "May 2022 - August 2022",
        "description": " • Implemented an automation solution for account consolidation across GitHub, Jenkins, Bitbucket, and LDAP, resulting in enhanced system efficiency and streamlined user account management. \n \n • Spearheaded the migration of an on-premises database to Azure cloud using Flyway and Azure Jump box, ensuring data security, seamless backups, and high availability for the Onboarding project. \n \n • Contributed to the development and improvement of an internal KPI website using Django and REST API, enhancing the platform's usability and value for data-driven decision-making. "
      },
      {
        "company": "EG Verse Technological Solutions",
        "title": "Software Designer",
        "years": "October 2020 - September 2021",
        "description": " • Managed end-to-end software lifecycle for multiple projects, consistently achieving high client satisfaction and timely delivery across North America. \n \n • Collaborated with backend developers to create dynamic web pages using JavaScript and Django framework, resulting in a 15% increase in website leads.\n \n • Developed and implemented React JS, Redux, and Node JS surveys for Medallia (SaaS) clients, effectively capturing user responses for comprehensive business analysis in the Medallia Experience Cloud. \n \n • Ensured product quality through rigorous testing, code reviews, and team collaboration, identifying and addressing issues during the development process. \n \n • Leveraged Scrum methodology and JIRA to optimize software workflow management, increasing task success rate by 25%."
      },
      {
        "company": "SoftVan Pvt Ltd.",
        "title": "Software Developer",
        "years": "January 2019 - March 2020",
        "description": "• Delivered high-quality results on time and within budget by actively participating in the complete software development process for multiple projects.\n \n • Designed and developed responsive, accessible, and high-performance UIs using ReactJS, Redux & GraphQL for over five projects, earning positive feedback from clients. \n \n • Enhanced user experience by implementing web services with J2EE using Spring MVC, Spring IOC, Spring Transactions, Spring security modules, and REST APIs, increasing average user time on page by 2 minutes. \n \n •  Developed and integrated microservices for inventory, scheduling, billing, currency exchange, and content management, significantly boosting online sales for a major Indian clothing brand. "
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "80%"
      },
      {
        "name": "Python",
        "level": "85%"
      },
      {
        "name": "Java",
        "level": "95%"
      },
      {
        "name": "AWS",
        "level": "75%"
      },
      {
        "name": "Node JS",
        "level": "95%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Web Search Engine (Java)",
        "category": "",
        "image": "snapchat.jpg",
        "url": "https://github.com/RaHuLMeghani24/WebSearchEngine"
      },
      {
        "title": "Airbnb Clone (React JS)",
        "category": "",
        "image": "airbnb.jpg",
        "url": "https://github.com/RaHuLMeghani24/airbnb-clone"
      },
      {
        "title": "Metaverse Web3.0 chat app (React JS & Moralis)",
        "category": "",
        "image": "metaverse.jpg",
        "url": "https://github.com/RaHuLMeghani24/metaverse-app"
      },
      {
        "title": "Cricket Data Processor (Apache Cassandra, Spring)",
        "category": "",
        "image": "cricket.jpg",
        "url": "https://github.com/RaHuLMeghani24/cricket-data-processor"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Rahul is a pleasure to work with! He takes initiative, troubleshoots with an open mind and determination, and has become a true Medallia software implementer and guru. I highly recommend Rahul to any team, with no hesitation. I can’t wait to see what he does next!",
        "user": "Amy (via LinkedIn)"
      }
    ]
  }
}
